{
    "Joining": "Joining processes are used to attach parts together, whether they are made of the same or different materials.",
    "Welding": "A casting process where a small amount of metal is melted on each part, with some processes adding filler metal, and allowed to solidify, joining the parts together.",
    "Porosity": "The measurement of the space or holes in a material. Often caused by the joining process during solidification. These pores can reduce the strength of the part and are considered stress raisers.",
    "Spatter": "Dispersion of molten metal on the worksurface caused by non-ideal welding parameters.",
    "Resistance": "Resistance welding is a process where pressure is applied to parts and a high-power electric current is passed through the parts, which melts and fuses the parts together.",
    "Solid State": "Using heat and pressure to join parts without melting the parts or using filler material.",
    "Spot Welding": "A resistance welding process. Spot welding is commonly used to weld metal sheets together using pressure and electric current to heat and fuse the metal.",
    "H.A.Z": "The Heat Affected Zone is a band of metal on the original part that is affected by the high temperatures of the welding process and results in that section of the part being weaker. A welded joint should fail at the heat affected zone.",
    "Shielded Metal Arc Welding (SMAW)": "The cheapest welding process, requiring only an electrode and a power source to generate an arc and melt the filler metal. This process usually involves the electrode being coated with flux.",
    "Gas Metal Arc Welding (GMAW) or Metal Inert Gas Welding (MIG)": "This process is much easier to do and has a lot higher productivity rate. MIG welding uses a gas mixture in addition to an arc welding process with filler rod, where the gas acts as the flux. When complete, this process leaves little to no slag on the surface, reducing finishing and postprocessing times.",
    "Plasma Welding": "an arc welding process using ionized gas at high temperature to melt and join metals. A higher energy dense version of welding similar to TIG.",
    "Oxy Fuel Welding": "A welding process that uses an oxygen and fuel mixture to light a fire hot enough to melt the metal, at which point a filler metal is added to join the pieces together.",
    "Electron Beam Welding": "The most energy dense welding process, electron beam welding is a process where a high energy beam of focused electron is used inside of a vacuum to join metals.",
    "Laser Welding": "A process for small scale welding processes where a laser is used to melt and fuse metal parts.",
    "Bead": "The name for the strip of metal where the two pieces are joined, and the filler material was added.",
    "Flux": "with the purpose of cleaning, protecting the weld from the atmosphere, and promoting capillary reaction.",
    "Slag/Oxide": "A layer formed on top of the weld bead that is caused by flux.",
    "Brazing": "Brazing has a lower energy density than welding and is where the filler material acts more as a glue instead of directly bonding the two parts. Brazing is used when the filler material and the parts are not the same material.",
    "Friction": "Welding two pieces of metal using friction to generate enough heat to melt the metal and fuse the two pieces together. Usually achieved by spinning the parts and pressing them together with high speed and force.",
    "Soldering": "Most common joining process in electronics. Soldering is",
    "Penetration": "The measurement of how far the filler material fuses into the two joined parts in a welding process.",
    "Sintering": "A finishing process for ceramic materials where a powdered metal and binder mixture is heated to fuse metal particles together and to remove the binder material.",
    "Shrinkage": "In a process like sintering, powdered metals are subjected to shrinkage when the material’s air or binder is removed from between the particles. This shrinkage must be taken into consideration for the final part’s dimensional tolerances.",
    "Powder Metallurgy": "A general category of processes where metal powder is compressed into a shape and then sintered.",
    "Physical atomization": "A process to create metal powders by converting liquid metal into small powder particles, using an atomizing water spray.",
    "Mechanical Hammer Milling": "crushing a material into small pieces by repeated impacts by hammers.",
    "Atomized Water Spray": "high pressure water is sprayed onto molten metal which forms small irregular shaped particles, used in physical atomization processes.",
    "Inert Gas": "Inert gas is a much higher quality metal powder manufacturing process where gas is added to a vacuum chamber and molten metal is forced through a nozzle against a high-power gas spray, which forms small particles.",
    "Brittle": "A material that is very resistant to compression forces and is thought of as very strong, however shatters catastrophically under tension force.",
    "Isostatic Pressing": "Isostatic pressing is a process used to reduce porosity. In general, this is done by compressing powdered materials to increase density and remove particle gaps.",
    "HIP": "Hot isostatic pressing uses high heat in an enclosed inert gas environment to prevent chemical reaction.",
    "CIP": "Cold isostatic pressing submerges the part in a flexible mold surrounded by fluid to add pressure.",
    "MIM": "Metal injection molding is a combination of powder metallurgy and traditional plastic injection molding. This process uses powdered metal mixed with binder material, which is then injected into a mold. After the part is removed from the mold, it is sintered to remove binder and to close the particle gaps, creating the final product.",
    "Mechanical Compression": "Also called compression molding, this is a process where a part is compacted into a mold to shape the part, in this context it is used to make green parts in powder manufacturing.",
    "3D Printing": "A process where material is extruded in layers that can form very complex net-shape parts. In the context of powdered metal processes, 3d printers can print metal parts by extruding",
    "Ceramics": "A hard and brittle material that has a crystalline material structure and is insulating.",
    "Crystalline": "A type of material structure that is very organized and repeated and as a result, very strong.",
    "Additive": "A material mixed with a ceramic powder to achieve a specific property. Examples are binders, to “glue” particles together or deflocculants to reduce particle clumping.",
    "Vapor Deposition": "A process where a solid material is formed through condensation, commonly used to create films or powders.",
    "Refractories": "Refractories are used as liners for high temperature furnaces. These liners are heat-resistant ceramic materials.",
    "Whitewares": "A category of ceramics including sanitaryware, stoneware, porcelain, earthenware, and enamels.",
    "Drawing": "Drawing in the context of glass manufacturing means glass is softened with heat and rolled through a series of rollers to form a glass sheet.",
    "Rolling": "Rolling ceramics is done by rolling a metal powder and binder mixture to a certain thickness.",
    "Float": "A process to make sheet glass by first passing through a float bath of molten tin, resulting in near distortion-free and smooth surfaces, and then getting rolled int a final sheet.",
    "Dry Pressing": "Compacting dry ceramic powders within a die to form a specific shape.",
    "Slip Casting": "Mostly used for sanitary-ware, slip casting is a ceramics process where a liquid mixture is poured into a mold and allowed time to dry. Most of the liquid volume is poured out of the mold and a layer is left on the mold, which is then fired to solidify.",
    "Extrusion": "Extrusion in the context of ceramics generally means a clay mixture is extruded into a clay slug which is then pressed and formed on a spinning mold",
    "Glass": "A non-crystalline material that softens with heat and is generally made from soda ash, borax, and sand.",
    "Glass Blowing": "A process where air is blown into a molten piece of glass to make a hollow glass part. New technologies use molds to form the glass into a specific shape and tolerance.",
    "Sheet Glass": "A flat piece or sheet of glass that can be made by either drawing or float processes.",
    "Manufacturing": "Making a product from a raw material.",
    "test": "test",
    "qwerty": "asdf"
}